# Rebar Bend Data Hook Length 1 Property

Source: https://www.revitapidocs.com/2026/cf4d57e1-01af-f37a-c5c7-af38cb263bd9.htm

---

| Rebar Bend Data Hook Length 1 Property |
| --- |

The extension length of the hook at the end.
 The default value is 0\.0\.
**Namespace:** Autodesk.Revit.DB.Structure
**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26\.0\.4\.0 (26\.0\.4\.0\) Syntax C\# VB C\+\+ F\#
```
public double HookLength1 { get; set; }
```

```
Public Property HookLength1 As Double
	Get
	Set
```

```
public:
property double HookLength1 {
	double get ();
	void set (double value);
}
```

```
member HookLength1 : float with get, set
```

#### Property Value

Double Exceptions

| Exception | Condition |
| --- | --- |
| ArgumentException | When setting this property: The given value for hookLength1 is not finite |

See Also

#### Reference

RebarBendData Class Autodesk.Revit.DB.Structure Namespace